<?php

return [
    'admin' => [
        'orders' => [
            'pickup' => [
                'title'    => 'पिकअप जानकारी',
                'location' => 'पिकअप स्थान',
                'date'     => 'पिकअप तिथि',
                'time'     => 'पिकअप समय',
            ],
        ],
        'system' => [
            'title'                => 'शीर्षक',
            'description'          => 'विवरण',
            'default_rate'         => 'डिफ़ॉल्ट दर',
            'pickup'               => 'स्टोर से पिकअप',
            'status'               => 'स्थिति',
            'display_address'      => 'चेकआउट फॉर्म में पिकअप पता दिखाएं',
            'instore_payment_only' => 'पिकअप ऑर्डर्स के लिए केवल स्टोर में भुगतान की अनुमति दें',
        ],
        'settings' => [
            'acl' => [
                'pickup_timeslots' => 'पिकअप टाइमस्लॉट',
                'create'           => 'बनाएँ',
                'delete'           => 'हटाएँ',
                'edit'             => 'संपादित करें',
            ],
            'pickup' => [
                'timeslots' => [
                    'index' => [
                        'title'        => 'पिकअप टाइमस्लॉट',
                        'add-button'   => 'पिकअप टाइमस्लॉट जोड़ें',
                        'no-timeslots' => 'अभी तक कोई टाइमस्लॉट नहीं जोड़ा गया है।',
                        'filter' => [
                            'title'            => 'पिकअप टाइमस्लॉट फ़िल्टर करें',
                            'clear'            => 'फ़िल्टर हटाएं',
                            'day'              => 'दिन',
                            'all_days'         => 'सभी दिन',
                            'all_inventories'  => 'सभी स्थान',
                            'inventory_source' => 'इन्वेंट्री स्रोत',
                        ],
                        'datagrid' => [
                            'id'                  => 'आईडी',
                            'inventory_source'    => 'इन्वेंट्री स्रोत',
                            'day'                 => 'दिन',
                            'weekday'             => 'सप्ताह का दिन',
                            'date'                => 'पिकअप तिथि',
                            'pickup_quota'        => 'पिकअप कोटा:',
                            'start_time'          => 'समय प्रारंभ',
                            'end_time'            => 'समय समाप्त',
                            'status'              => 'स्थिति',
                            'actions'             => 'कार्रवाई',
                            'edit'                => 'संपादित करें',
                            'delete'              => 'हटाएँ',
                            'mass-delete'         => 'हटाएँ',
                            'mass-delete-success' => 'टाइम स्लॉट सफलतापूर्वक हटाया गया।',
                            'mass-delete-error'   => 'टाइम स्लॉट हटाने में त्रुटि।',
                        ],
                    ],
                    'create' => [
                        'title'              => 'टाइम स्लॉट जोड़ें',
                        'inventory_source'   => 'इन्वेंट्री स्रोत',
                        'pickup_day'         => 'पिकअप दिन',
                        'start_time'         => 'समय प्रारंभ',
                        'end_time'           => 'समय समाप्त',
                        'pickup_quota'       => 'पिकअप कोटा',
                        'status'             => 'स्थिति',
                        'save-btn'           => 'सहेजें',
                        'success'            => 'टाइम स्लॉट सफलतापूर्वक जोड़ा गया।',
                        'duplicate'          => 'चयनित दिन और समय के लिए पहले से ही टाइम स्लॉट है।',
                        'error'              => 'टाइम स्लॉट जोड़ने में त्रुटि।',
                    ],
                    'edit' => [
                        'title'              => 'टाइम स्लॉट संपादित करें',
                        'inventory_source'   => 'इन्वेंट्री स्रोत',
                        'pickup_day'         => 'पिकअप दिन',
                        'start_time'         => 'समय प्रारंभ',
                        'end_time'           => 'समय समाप्त',
                        'pickup_quota'       => 'पिकअप कोटा',
                        'status'             => 'स्थिति',
                        'save-btn'           => 'सहेजें',
                        'success'            => 'टाइम स्लॉट सफलतापूर्वक अपडेट किया गया।',
                        'error'              => 'टाइम स्लॉट अपडेट करने में त्रुटि।',
                    ],
                    'delete-success' => 'टाइम स्लॉट सफलतापूर्वक हटाया गया।',
                    'delete-failed'  => 'टाइम स्लॉट हटाने में त्रुटि।',
                ],
            ],
        ],
    ],
    'shop' => [
        'checkout' => [
            'onepage' => [
                'shipping' => [
                    'pickup' => [
                        'title'               => 'पिकअप विकल्प',
                        'pickup_location'     => 'अपना आदेश प्राप्त करने के लिए एक स्थान चुनें',
                        'pickup_date'         => 'अपनी पसंदीदा पिकअप तिथि चुनें',
                        'pickup_time'         => 'एक सुविधाजनक समय स्लॉट चुनें',
                        'no_pickup_locations' => 'क्षमा करें, आपकी टोकरी में आइटम के लिए कोई पिकअप स्थान उपलब्ध नहीं है।',
                        'no_time_slots'       => 'क्षमा करें, चयनित स्थान और तिथि के लिए कोई समय स्लॉट उपलब्ध नहीं है।',
                        'details-missing'     => 'कृपया पिकअप स्थान, तिथि और समय का चयन करें।',
                    ],
                ],
            ],
        ],
        'emails' => [
            'orders' => [
                'pickup' => [
                    'ready_subject'     => 'आपका आदेश पिकअप के लिए तैयार है!',
                    'ready_message'     => 'आपका आदेश #:order_id, जो :created_at को किया गया था, अब पिकअप के लिए तैयार है।',
                    'details'           => 'पिकअप विवरण',
                    'location'          => 'पिकअप स्थान',
                    'selected_timeslot' => 'आपका चयनित समय स्लॉट',
                ],
            ],
        ],
    ],
    'week_days' => [
        1 => 'रविवार',
        2 => 'सोमवार',
        3 => 'मंगलवार',
        4 => 'बुधवार',
        5 => 'गुरुवार',
        6 => 'शुक्रवार',
        7 => 'शनिवार',
    ],
];
