<?php

return [
    'admin' => [
        'orders' => [
            'pickup' => [
                'title'    => 'Інформація про збірку',
                'location' => 'Місце збору',
                'date'     => 'Дата збору',
                'time'     => 'Час збору',
            ],
        ],
        'system' => [
            'title'                => 'Заголовок',
            'description'          => 'Опис',
            'default_rate'         => 'Типова ставка',
            'pickup'               => 'Збір у магазині',
            'status'               => 'Статус',
            'display_address'      => 'Показати адресу збору у формі оформлення замовлення',
            'instore_payment_only' => 'Дозволити оплату тільки в магазині для замовлень на збір',
        ],
        'settings' => [
            'acl' => [
                'pickup_timeslots' => 'Часові слоти для збору',
                'create'           => 'Створити',
                'delete'           => 'Видалити',
                'edit'             => 'Редагувати',
            ],
            'pickup' => [
                'timeslots' => [
                    'index' => [
                        'title'        => 'Часові слоти для збору',
                        'add-button'   => 'Додати час для збору',
                        'no-timeslots' => 'Часові слоти для збору ще не додано.',
                        'filter'       => [
                            'title'            => 'Фільтрувати часи збору',
                            'clear'            => 'Очистити фільтри',
                            'day'              => 'День',
                            'all_days'         => 'Усі дні',
                            'all_inventories'  => 'Усі локації',
                            'inventory_source' => 'Джерело запасів',
                        ],
                        'datagrid' => [
                            'id'                  => 'ID',
                            'inventory_source'    => 'Джерело запасів',
                            'day'                 => 'День',
                            'weekday'             => 'День тижня',
                            'date'                => 'Дата збору',
                            'pickup_quota'        => 'Квота збору',
                            'start_time'          => 'Час початку',
                            'end_time'            => 'Час закінчення',
                            'status'              => 'Статус',
                            'actions'             => 'Дії',
                            'edit'                => 'Редагувати',
                            'delete'              => 'Видалити',
                            'mass-delete'         => 'Видалити',
                            'mass-delete-success' => 'Часовий слот для збору успішно видалено.',
                            'mass-delete-error'   => 'Помилка при видаленні часового слоту для збору.',
                        ],
                    ],
                    'create' => [
                        'title'              => 'Додати час для збору',
                        'inventory_source'   => 'Джерело запасів',
                        'pickup_day'         => 'День збору',
                        'start_time'         => 'Час початку',
                        'end_time'           => 'Час закінчення',
                        'pickup_quota'       => 'Квота збору',
                        'status'             => 'Статус',
                        'save-btn'           => 'Зберегти',
                        'success'            => 'Часовий слот для збору успішно створено.',
                        'duplicate'          => 'Часовий слот для збору вже існує для вибраного дня і часу.',
                        'error'              => 'Помилка при створенні часового слоту для збору.',
                    ],
                    'edit' => [
                        'title'              => 'Редагувати час для збору',
                        'inventory_source'   => 'Джерело запасів',
                        'pickup_day'         => 'День збору',
                        'start_time'         => 'Час початку',
                        'end_time'           => 'Час закінчення',
                        'pickup_quota'       => 'Квота збору',
                        'status'             => 'Статус',
                        'save-btn'           => 'Зберегти',
                        'success'            => 'Часовий слот для збору успішно оновлено.',
                        'error'              => 'Помилка при оновленні часового слоту для збору.',
                    ],
                    'delete-success' => 'Часовий слот для збору успішно видалено.',
                    'delete-failed'  => 'Помилка при видаленні часового слоту для збору.',
                ],
            ],
        ],
    ],
    'shop' => [
        'checkout' => [
            'onepage' => [
                'shipping' => [
                    'pickup' => [
                        'title'               => 'Опції для збору',
                        'pickup_location'     => 'Виберіть місце для отримання вашого замовлення',
                        'pickup_date'         => 'Виберіть бажану дату збору',
                        'pickup_time'         => 'Виберіть зручний час',
                        'no_pickup_locations' => 'Вибачте, немає доступних місць збору для товарів у вашому кошику.',
                        'no_time_slots'       => 'Вибачте, немає доступних часових слотів для вибраного місця і дати.',
                        'details-missing'     => 'Будь ласка, виберіть місце збору, дату та час.',
                    ],
                ],
            ],
        ],
        'emails' => [
            'orders' => [
                'pickup' => [
                    'ready_subject'     => 'Ваше замовлення готове для збору!',
                    'ready_message'     => 'Ваше замовлення #:order_id, яке було розміщене :created_at, тепер готове до збору.',
                    'details'           => 'Деталі збору',
                    'location'          => 'Місце збору',
                    'selected_timeslot' => 'Вибраний час для збору',
                ],
            ],
        ],
    ],
    'week_days' => [
        1 => 'Понеділок',
        2 => 'Вівторок',
        3 => 'Середа',
        4 => 'Четвер',
        5 => 'П\'ятниця',
        6 => 'Субота',
        7 => 'Неділя',
    ],
];
