<?php

return [
    'admin' => [
        'orders' => [
            'pickup' => [
                'title'    => 'සැරසුම් තොරතුරු',
                'location' => 'ඉස්සෙවීමේ ස්ථානය',
                'date'     => 'ඉස්සෙවීමේ දිනය',
                'time'     => 'ඉස්සෙවීමේ වේලාව',
            ],
        ],
        'system' => [
            'title'                => 'ශීර්ෂය',
            'description'          => 'විස්තරය',
            'default_rate'         => 'පෙරනිමි අනුපාතය',
            'pickup'               => 'වෙළඳසැලෙන් ආපසු ගෙන යාම',
            'status'               => 'පිළිගැනීම',
            'display_address'      => 'ඉස්සෙවීමේ ලිපිනය පෙන්වන්න',
            'instore_payment_only' => 'ඉස්සෙවීමේ ඇණවුම් සඳහා පමණක් ගෙවීම් සලස්වන්න',
        ],
        'settings' => [
            'acl' => [
                'pickup_timeslots' => 'ඉස්සෙවීමේ වේලාව',
                'create'           => 'සෑදීම',
                'delete'           => 'මකා දැමීම',
                'edit'             => 'සංස්කරණය',
            ],
            'pickup' => [
                'timeslots' => [
                    'index' => [
                        'title'        => 'ඉස්සෙවීමේ වේලාව',
                        'add-button'   => 'ඉස්සෙවීමේ වේලාවක් එක් කරන්න',
                        'no-timeslots' => 'ඉස්සෙවීමේ වේලාවන් එක් කර නොමැත.',
                        'filter' => [
                            'title'            => 'ඉස්සෙවීමේ වේලාවන් පෙන්වන්න',
                            'clear'            => 'ෆිල්ටර් ඉවත් කරන්න',
                            'day'              => 'දවස',
                            'all_days'         => 'සියලු දින',
                            'all_inventories'  => 'සියලු ස්ථාන',
                            'inventory_source' => 'සාමාන්‍ය මාර්ගය',
                        ],
                        'datagrid' => [
                            'id'                  => 'ID',
                            'inventory_source'    => 'සාමාන්‍ය මාර්ගය',
                            'day'                 => 'දවස',
                            'weekday'             => 'සතිඅන්තය',
                            'date'                => 'දිනය',
                            'pickup_quota'        => 'අවලංගු පිරිනැමීම:',
                            'start_time'          => 'ආරම්භක වේලාව',
                            'end_time'            => 'අවසන් වේලාව',
                            'status'              => 'තත්වය',
                            'actions'             => 'ක්‍රියා',
                            'edit'                => 'සංස්කරණය කරන්න',
                            'delete'              => 'මකා දමන්න',
                            'mass-delete'         => 'මකා දමන්න',
                            'mass-delete-success' => 'සැරසුම් වේලාව මකා දැමීම සාර්ථකයි.',
                            'mass-delete-error'   => 'සැරසුම් වේලාව මකා දැමීමේ දෝෂයක්.',
                        ],
                    ],
                    'create' => [
                        'title'              => 'සැරසුම් වේලාවක් එකතු කරන්න',
                        'inventory_source'   => 'සාමාන්‍ය මාර්ගය',
                        'pickup_day'         => 'ඉස්සෙවීමේ දිනය',
                        'start_time'         => 'ආරම්භක වේලාව',
                        'end_time'           => 'අවසන් වේලාව',
                        'pickup_quota'       => 'ඉස්සෙවීමේ කෝටාව',
                        'status'             => 'තත්වය',
                        'save-btn'           => 'සුරකිනවා',
                        'success'            => 'සැරසුම් වේලාව සාර්ථකව එකතු කළා.',
                        'duplicate'          => 'එම දිනය හා වේලාව සම්බන්ධ සැරසුම් වේලාව දැනට පවතී.',
                        'error'              => 'සැරසුම් වේලාව එකතු කිරීමේ දෝෂයක්.',
                    ],
                    'edit' => [
                        'title'              => 'සැරසුම් වේලාව සංස්කරණය කරන්න',
                        'inventory_source'   => 'සාමාන්‍ය මාර්ගය',
                        'pickup_day'         => 'ඉස්සෙවීමේ දිනය',
                        'start_time'         => 'ආරම්භක වේලාව',
                        'end_time'           => 'අවසන් වේලාව',
                        'pickup_quota'       => 'ඉස්සෙවීමේ කෝටාව',
                        'status'             => 'තත්වය',
                        'save-btn'           => 'සුරකිනවා',
                        'success'            => 'සැරසුම් වේලාව සාර්ථකව යාවත්කාලීන කරන ලදී.',
                        'error'              => 'සැරසුම් වේලාව යාවත්කාලීන කිරීමේ දෝෂයක්.',
                    ],
                    'delete-success' => 'සැරසුම් වේලාව මකා දැමීම සාර්ථකයි.',
                    'delete-failed'  => 'සැරසුම් වේලාව මකා දැමීමේ දෝෂයක්.',
                ],
            ],
        ],
    ],
    'shop' => [
        'checkout' => [
            'onepage' => [
                'shipping' => [
                    'pickup' => [
                        'title'               => 'සැරසුම් විකල්ප',
                        'pickup_location'     => 'ඔබේ ඇනවුම ලබාගැනීමට ස්ථානය තෝරන්න',
                        'pickup_date'         => 'ඔබේ කැමති සැරසුම් දිනය තෝරන්න',
                        'pickup_time'         => 'ඔබට පහසු වේලාව තෝරන්න',
                        'no_pickup_locations' => 'ඔබේ රැඳීම් ට්රෝකම පිටවීම සඳහා සැරසුම් ස්ථානය නොමැත.',
                        'no_time_slots'       => 'ඉස්සෙවීමේ ස්ථානයේ හා දිනයේ යම් වේලාවක් නොමැත.',
                        'details-missing'     => 'කරුණාකර මැනවින් ඔබේ පිහිටි ස්ථානය, දිනය සහ වේලාව තෝරන්න.',
                    ],
                ],
            ],
        ],
        'emails' => [
            'orders' => [
                'pickup' => [
                    'ready_subject'     => 'ඔබේ ඇනවුම සැරසුමට ලැබීමට සූදානම්!',
                    'ready_message'     => 'ඔබේ ඇනවුම #:order_id, :created_at දින ලැබූවයි, සූදානම් වීම සඳහා.',
                    'details'           => 'සැරසුම් තොරතුරු',
                    'location'          => 'ස්ථානය',
                    'selected_timeslot' => 'තෝරාගත් සැරසුම් වේලාව',
                ],
            ],
        ],
    ],
    'week_days' => [
        1 => 'සඳුදා',
        2 => 'අඟහරුවාදා',
        3 => 'බදාදා',
        4 => 'බ්‍රහස්පතින්දා',
        5 => 'සිකුරාදා',
        6 => 'සෙනසුරාදා',
        7 => 'ඉරිදා',
    ],
];
